---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Index
source: html/323950f3-5ee5-3389-0550-afc0de72f439.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Index Property

Return the index of this connector

## Syntax (C#)
```csharp
public int Index { get; }
```